file = open('file.txt', 'r') #відкриваємо файл та присвоюємо змінну
paragraphs = file.read().split('\n') #зчитуємо вміст файлу та розбиваємо на абзаци
search_word = input('Введіть слово для пошуку: ') #запитуємо у користувача слово яке потрібно знайти та робимо
found_paragraphs = [] #створюємо список для збереження абзаців у яких міститься введене слово користувача
for paragraph in paragraphs: #проводимо ітерацію через кожен абзац у paragraphs
    if search_word in paragraph.lower(): #перевіряємо чи в абзаці є слово користувача та без врахування регістру
        found_paragraphs.append(paragraph) #якщо слово користувача є в абзаці, то додається весь абзац до found_paragraphs
if len(found_paragraphs) > 0: #перевіряємо, чи є абзаци, які містять слово користувача
    for paragraph in found_paragraphs: #якщо є абзац, то проводимо ітерацію через нього
        print(paragraph) #виводить абзаци в яких є слово користувача
else: #якщо нема слова користувача у файлі, то виводить текст
    print("Вашого слова немає у файлі") #виводить текст




